import requests,json,telebot

 
print(f"""\33[1;92m
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\x1b[1;91m⣤⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⡆\033[1;92m
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\x1b[1;91m⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⠀⠀⠀⠀⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\x1b[1;91m⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⠀⠀⠀⠀⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\x1b[1;91m⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\x1b[1;91m⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\x1b[1;91m⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋⠉⠁⠉⠉⠉⠛⠻⢿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠻⠿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\x1b[1;91m⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⠈⠙⠻⢿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\x1b[1;91m⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⢰⡄⠀⠀⠀⢳⡄⣿⣶⣄⠀⢿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\x1b[1;91m⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⢸⣿⣦⠀⠀⢸⣿⣿⣿⣿⣷⣸⣿⣿⣿⡇\033[1;92m
⠠⢤⣄⣀⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\x1b[1;91m⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⠀⠀⠀⠀⣿⣿⣷⡀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠈⠙⠻⣿⣿⠿⠃⠀⠀⠀⠀⠀⠀⠀⣀⣀⣀⣀⣀⣀⣀⣀⣀⣀⣀⣀⣀⣀⣀\x1b[1;91m⠿⠿⠿⠿⠿⠿⠟⠛⠻⣿⡀⠀⠀⠀⣿⣿⣿⣷⡘⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⠈⠀⠀⢀⣀⠀⠀⠀⠀⠀⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\x1b[1;91m⠀⠀⠀⠀⠀⠀⠀⠀⠀⢿⡇⠀⠀⠀⣿⣿⣿⣿⣧⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⢀⣤⣾⣿⠟⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿\x1b[1;91m⣀⣀⡀⠀⠀⣀⠀⠀⠀⢸⣧⠀⠀⢰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⣠⡶⠿⠟⠛⠁⠀⠀⠀⠀⠀⢀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⣫⣶⡿\x1b[1;91m⣀⣀⡉⠓⠞⠁⠀⠀⠀⢸⣿⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠏⢸⣿⡏⣴\x1b[1;91m⠁⢀⠉⢢⠀⠀⠀⠀⠀⢸⣿⠀⠀⡎⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢇⣶⠸⣿⣇⠻\x1b[1;91m⣀⡼⠀⢸⠀⠀⠀⠀⠀⢸⣿⠀⢠⠁⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣏⠸⢿⣧⠙⢿⣿\x1b[1;91m⠁⠀⣠⡞⠀⠀⠀⠀⠀⢸⣿⢀⡎⠀⠀⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⠀⠀⢰⣶⣦⡀⠀⠀⠀⠀⠻⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⣶⣶⣶⣶\x1b[1;91m⠘⠋⠉⠀⠀⠀⠀⠀⠀⢸⣿⣾⢁⣀⣀⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣇⠀⣿⣿⣿⣷⣶⣦⣤⣉⠉⠩⣍⣉⣙⣛⡛⠛⠛⠛⠛\x1b[1;91m⣀⣤⣤⣤⣤⣴⣶⣶⡶⣾⡿⠛⠛⠛⠉⢹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⢰⣿⣿⣿⡿⠿⠟⠛⠛⠳⠦⢌⠻⢿⣿⣿⣿⣿⣿⠀\x1b[1;91m⠀⠉⠉⢀⠴⠚⠉⠀⠀⣼⠁⢀⣀⣤⠄⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⠀⠀⢼⣿⣿⣿⣿⣿⣿⣿⣿⣔⣾⣿⠁⢠⡄⠐⣮⣴⣭⣿⣿⣿⣿⣆\x1b[1;91m⠀⠀⠀⠀⠀⠈⠉⠉⠉⠉⠉⠉⠁⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⠀⠀⠸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣭⣤⣬⣥⣬⣽⣿⣿⣿⣿⣿⣿⣿\x1b[1;91m⡇⠀⠀⠀⣠⣤⣤⣤⣤⣤⣤⣤⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⠀⠀⠀⠙⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\x1b[1;91m⡇⠀⠀⠀⠈⢻⣿⣿⣿⣿⡟⠁⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣿⣿⡿⣿⠿⣛⣭⣷⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\x1b[1;91m⡇⠀⠀⠀⠀⠀⠙⠿⠿⠋⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠿⠇⢱⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\x1b[1;91m⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣿⣿⣿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠿\x1b[1;91m⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⢟⣵⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣄⡀\x1b[1;91m⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠻⣿⣿⣿⣿⡿⣻⣿⣿⡿⠛⠛⠛⠛⠛⠛\x1b[1;91m⠀⢀⣀⣀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠿⣿⢟⣽⣿⣿⣿⣿⣷⣶⣿⡿⠿⠿\x1b[1;91m⠿⠷⠀⠀⠀⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠺⢿⣿⣿⣿⣿⣿⣿⣿⣿⣄⡀\x1b[1;91m⠀⠀⠀⠀⠀⠀⠀⠀⣠⣾⠟⢹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣄⠙⠿⣿⣿⣿⣿⣿⣿⣿⣿\x1b[1;91m⣦⡀⠀⠀⠀⣠⣴⡿⠟⠁⠀⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣷⣤⡈⠛⠿⣿⣿⣿⣿⠟\x1b[1;91m⣋⣠⣤⣶⡿⠟⠋⠀⠀⠀⢠⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⣿⣿⣿⣿⣿⣷⣶⣤⣤⣤⣤⣤\x1b[1;91m⠛⠛⠉⠁⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇\033[1;92m
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠼⠿⠿⠿⠿⠿⠿⠿⠿⠿⠿⠿⠿⠿\x1b[1;91m⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⠿⠿⠿⠿⠿⠿⠿⠿⠿⠿⠿⠿⠿⠿⠿⠿⠿⠇\033[1;92mDEVLOPED BY LAST WARNING & BADLIAR """)
def linex():
 print('\033[1;97m\033[1;97m__PLEAS\033[1;92m DONT\x1b[1;91m SELL_____\033[1;92m')

T = '7856951971:AAHhnHq_LTdvjC-cBrIuonXeJSzOfLNC7so'
B = telebot.TeleBot(T)
he = {'Host': 'api.openai.com','Accept': 'text/event-stream,application/json','Cache-Control': 'no-cache','Authorization': 'Bearer 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','Accept-Charset': 'UTF-8','User-Agent': 'Ktor client','Content-Type': 'application/json'}
@B.message_handler(commands=['start'])
def C1(mess):
    B.reply_to(mess,'''<b>🙏𝑾𝑬𝑳𝑪𝑶𝑴𝑬 𝑻𝑶 👿𝑳𝑨𝑺𝑻 𝑾𝑨𝑹𝑵𝑰𝑵𝑮👿& ☠️𝑩𝑨𝑫𝑳𝑰𝑨𝑹☠️ 𝑪𝑯𝑨𝑻 🤖𝑮𝑷𝑻 𝑩𝑶𝑻 😎</b>

<b> 💞𝑩𝑨𝑫𝑳𝑰𝑨𝑹💞𝑻𝑬𝑳𝑬𝑮𝑹𝑨𝑴 𝑰𝑫 🪪 @BADLIAR2001</b>
<b>💞𝑳𝑨𝑺𝑻 𝑾𝑨𝑹𝑵𝑰𝑵𝑮💞𝑻𝑬𝑳𝑬𝑮𝑹𝑨𝑴 𝑰𝑫 🪪 @hardhackar007</b>

<b>𝑨𝑰 𝑮𝑷𝑻-𝟒𝑶-𝑴𝑰𝑵𝑰 𝑷𝑹𝑰𝑴𝑬 🔥𝑭𝑹𝑬𝑬 𝑪𝑯𝑨𝑻 𝑮𝑷𝑻 𝑩𝑶𝑻 𝑷𝑹𝑶𝑽𝑰𝑫𝑬 𝑩𝒀 𝑩𝑨𝑫𝑳𝑰𝑨𝑹 ✨ 𝑫𝑬𝑽𝑬𝑳𝑶𝑷𝑬𝑹 𝑩𝒀✨ 𝑳𝑨𝑺𝑻 𝑾𝑨𝑹𝑵𝑰𝑵𝑮🔥</b>

<b>⚡️ ¦ HOW CAN I HELP YOU?.</b>''',parse_mode='HTML')
@B.message_handler(func=lambda msg: True)
def C2(msg):
    m = msg.text
    tyr = B.send_message(msg.chat.id,"@hardhackar007 𝑷𝑳𝑬𝑨𝑺𝑬 𝑾𝑨𝑰𝑻✨")
    dat = {'model': 'gpt-4o-mini','messages': [{'role': 'system','content': 'You are a helpful assistant that responds in the language specified by the user.'},{'role': 'user','content': m}],'n': 1,'stream': True}
    r = requests.post('https://api.openai.com/v1/chat/completions',headers=he,json=dat)
    rs = ""
    for xx in r.iter_lines():
        if xx and xx.decode('utf-8').startswith('data: '):
            try:
                js = json.loads(xx.decode('utf-8')[6:])
                if 'choices' in js and len(js['choices']) > 0:
                    rs += js['choices'][0]['delta'].get('content','')
            except json.JSONDecodeError:
                continue
    if '```' in rs:
        B.edit_message_text(rs,chat_id=msg.chat.id,message_id=tyr.message_id,parse_mode='Markdown')
    else:
        B.edit_message_text(f"<b>{rs}</b>",chat_id=msg.chat.id,message_id=tyr.message_id,parse_mode='HTML')
B.polling()
